["Department of Electronics & Communication Engineering (ECE)", "1. Dr. Afreen Khursheed Nanoelectronics and Nanomaterials, Low power VlSI device modelling afreenkhursheed10@gmail.com", "2. Dr. Bhupendra Singh Kirar Signal and Image Processing, Signal Decomposition Techniques, Computer Aided Medical Diagnosis, Machine Learning bhup17@gmail.com", "3. Dr. Deepa Sharma Image Processing er.deepa.in@gmail.com", "4. Dr. Neeraj Kumar Signal Processing, Music Signal Processing, Biomedical Signal Processing, Wavelet Transform and Machine Learning. kumarneeraj.mit@gmail.com", "5. Dr. Gaurav Kumar Bharti Cyber Physical System, Quantum Computing, Photonics, Nonlinear Optics, Optical Sensors. gkbharti.iiitbhopal@gmail.com", "6. Dr. Prince Kumar Singh Modeling , Simulation, and Fabrication of advanced CMOS devices princeims36@gmail.com", "Department of Computer Science & Engineering (CSE)", "1. Dr. Nikhil Kumar Singh Social Media Mining, Machine Learning, Natural Language Processing [On Deputation for Post-Doctoral Fellow] nikhilsinghmanit@gmail.com", "2. Dr. Gagan Vishwakarma Machine Learning, Image and Video Processing gagan.manit2020@gmail.com", "3. Dr. Yatendra Sahu Natural Language Processing, Machine Learning, Web Technology and Cloud Computing yatendra.manit@gmail.com", "4. Dr. Sonal Telang Chandel Computer Networks, Wireless Sensor Networks, and Data Structures sonal.telang@gmail.com", "5. Dr. Arpita Bhargava Artificial Intelligence, Uncertainty, Machine Learning, Wireless Networks, Trust and Recommendation System arpitabhargava3003@gmail.com", "6. Dr. Saurabh Jain Robotics, Cloud Robotics, Cloud Computing, Information Security saurabh0758@gmail.com", "Department of Information Technology (IT)", "1. Dr. Rekha Kaushik Mobile Ad-hoc Networks, Machine Learning, IoT rekhakaushik28@gmail.com", "2. Dr. Shalini Stalin Image Processing shalini.stalin@yahoo.com", "3. Dr. Vishakha Chourasia Vehicular Delay Tolerant Network, Machine Learning vishakhachourasia23@gmail.com", "4. Dr. Dharmendra Dangi Sentiment Analysis, Machine Learning, Deep Learning, Natural Language Processing dangi28dharmendra06@gmail.com", "Mathematics", "1. Dr. Nisha Singhal Applied Mathematics (Soft Set Theory, Hybrid Structures of Soft Sets, MCDM), Fuzzy Algorithms and Fuzzy Modelling, Applications of Artificial Intelligence, Supply Chain Modelling nishamanit@gmail.com", "2. Dr. Indira Mishra Homogenization Optimal Controls, Elliptic Partial Differential Equations, Almost periodic solutions, Almost automorphic solutions Indira.mishra1@gmail.com", "Physics", "1. Dr. Nikita Acharya Condensed Matter Physics acharyaniks30@gmail.com", "2. Dr. Anjani Kumar Experimental Condensed Matter Physics, Materials Science anjanikumar51284@gmail.com"]