{
    "about1" : "Prof. Ashutosh Kumar Singh joined IIIT Bhopal as Founder Director in May 2023. He is a distinguished scholar and educator specializing in Electronics and Computer Engineering. He is charted engineer and earned his Ph.D. in Electronics Engineering from the prestigious Indian Institute of Technology-BHU, Varanasi, India. He has been a Post-Doctoral Research Fellow with the Department of Computer Science, University of Bristol, United Kingdom. He received the prestigious Japan Society for the Promotion of Science (JSPS) fellowship to visit the University of Tokyo and other Japanese Universities as a visiting researcher. He has also worked as a visiting scientist at the Frankfurt Institute for Advanced Studies, Goethe University, Germany.",
    "about2": "Our Director Prof. Singh has a rich experience of more than two decades of with various university systems across India, the UK, Australia, and Malaysia. He is a Professor with the Department of Computer Applications at the National Institute of Technology Kurukshetra, India. He has been involved in different administrative capacities including Head of the Department, Associate/Deputy Dean, Professor-in-charge, Examination Controller/ Superintendent, and Chairman/Member of different committees at the Institute/ National/ International level. He has also served Govt. of India in various positions such as the visitor nominee and convener of the National IT Challenge for Youth with Disabilities, etc.",
    "about3": "Our Director Prof. Singh's research focuses on a broad range of topics such as Cloud Computing, Big Data Analytics, Machine Learning, Cyber Security, Verification, Synthesis, Design and Testing of Digital Circuits, and Web Technology. He has guided 11 doctoral theses and more than 100 master's students. He has authored over 350 publications in various forms such as peer-reviewed journals, books, conferences, book chapters, and news magazines. He has co-authored eleven books, including Machine Learning for Cloud Management, Web Spam Detection Application using Neural Network,Digital Systems Fundamentals and Computer System Organization & Architecture. He has also served as the principal investigator/investigator for six sponsored research projects and played a vital role in a project funded by EPSRC (United Kingdom) titled Logic Verification and Synthesis in New Framework",
    "about4": "Our Director Prof. Singh has traveled extensively across several countries, including Australia, the United Kingdom, South Korea, China, Thailand, Indonesia, Japan, Germany, Switzerland, and the USA, for collaborative research work, invited talks, and presented his research findings. He has received multiple awards, including Best Paper Awards, Merit Awards-2003 (Institute of Engineers), Best Presenter Awards, and the Bintulu Development Authority Best Postgraduate Research Paper Award. Prof. Singh continuously serves many journals and conferences in different capacities such as associate editor, chair, advisory committee member, etc.",
    "about5" : "Here is more info about our director : https://scholar.google.com/citations?user=1pBXMOgAAAAJ&hl=en"
}
